# Pandas 문자열 연산

In [1]:
import pandas as pd
import numpy as np

In [2]:
x = np.array([2, 3, 5, 7, 11, 13])
x * 2

array([ 4,  6, 10, 14, 22, 26])

In [3]:
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[s.capitalize() for s in data] # 문자열 첫 글자 대문자 변환 (None 값에선 동작 X)

['Peter', 'Paul', 'Mary', 'Guido']

In [4]:
names = pd.Series(data)
names

0    peter
1     Paul
2     MARY
3    gUIDO
dtype: object

In [5]:
names.str.capitalize() # pandas Series 객체에선 str 메서드 사용 가능

0    Peter
1     Paul
2     Mary
3    Guido
dtype: object

# Pandas String Method

In [6]:
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam', 'Eric Idle', 'Michael Palin'])

In [7]:
monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4     michael palin
dtype: object

In [8]:
monte.str.len()

0    14
1    11
2    13
3     9
4    13
dtype: int64

In [9]:
monte.str.startswith('T') # 시작 문자 검색 (True/False)

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [10]:
monte.str.split()

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4     [Michael, Palin]
dtype: object

## 정규표현식 Methods

In [ ]:
monte.str.extract('([A-Za-z]+)', expand = False) # 정규 표현식 사용

0     Graham
1       John
2      Terry
3       Eric
4    Michael
dtype: object

In [ ]:
monte.str.extract('([A-Za-z]+)', expand = True) # expand = True로 DataFrame 형태로 반환

         0
0   Graham
1     John
2    Terry
3     Eric
4  Michael

In [22]:
monte.str.findall(r'^[^AEIOU].*[^aeiou]$') # AEIOU로 시작하지 않고, aeiou로 끝나지 않는

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4     [Michael Palin]
dtype: object

## 그 외 Methods

In [25]:
# Vectorized item and slicing
monte.str[0:3]

0    Gra
1    Joh
2    Ter
3    Eri
4    Mic
dtype: object

In [26]:
monte.str.split().str.get(-1)

0    Chapman
1     Cleese
2    Gilliam
3       Idle
4      Palin
dtype: object

In [28]:
# indicator variables
full_monte = pd.DataFrame({'name' : monte, 'info' : ['B|C|D', 'B|D', 'A|C', 'B|C', 'B|C|D']})
full_monte

             name   info
0  Graham Chapman  B|C|D
1     John Cleese    B|D
2   Terry Gilliam    A|C
3       Eric Idle    B|C
4   Michael Palin  B|C|D

In [29]:
full_monte['info'].str.get_dummies('|')

   A  B  C  D
0  0  1  1  1
1  0  1  0  1
2  1  0  1  0
3  0  1  1  0
4  0  1  1  1

# Example : Recipe Database